# CanBeDeleted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementType..::..CanBeDeleted Property
ElementType Class See Also
---
Determine if this ElementType can be deleted
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool CanBeDeleted { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CanBeDeleted As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CanBeDeleted {
	bool get ();
}
```

# See Also
ElementType Class
Autodesk.Revit.DB Namespace